キー結合

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

pd.set_option("display.max_rows", 6)

名前のデータフレーム定義

In [2]:
df_name = pd.DataFrame(
    {
        "key": [1, 1, 3, 2, 5],
        "name": ["asuka", "yuuki", "siho", "rina", "manaka"]
    }
)

所属のデータフレーム定義

In [4]:
df_group = pd.DataFrame(
    {
        "key": [1, 2, 3, 4],
        "group": ["nogi", "sakura", "hinata", "yosimoto"]
    }
)

In [5]:
df_name

   key    name
0    1   asuka
1    1   yuuki
2    3    siho
3    2    rina
4    5  manaka

In [6]:
df_group

   key     group
0    1      nogi
1    2    sakura
2    3    hinata
3    4  yosimoto

df_nameとdf_groupをinner_join

In [7]:
pd.merge(df_name, df_group, how="inner")

   key   name   group
0    1  asuka    nogi
1    1  yuuki    nogi
2    3   siho  hinata
3    2   rina  sakura

df_nameとdf_groupをinner_join(inner_joinはhowを省略可)

In [8]:
pd.merge(df_name, df_group, "inner")

   key   name   group
0    1  asuka    nogi
1    1  yuuki    nogi
2    3   siho  hinata
3    2   rina  sakura

df_nameとdf_groupをleft_join

In [9]:
pd.merge(df_name, df_group, how="left")

   key    name   group
0    1   asuka    nogi
1    1   yuuki    nogi
2    3    siho  hinata
3    2    rina  sakura
4    5  manaka     NaN

df_nameとdf_groupをright_join

In [10]:
pd.merge(df_name, df_group, how="right")

   key   name     group
0    1  asuka      nogi
1    1  yuuki      nogi
2    2   rina    sakura
3    3   siho    hinata
4    4    NaN  yosimoto

df_nameとdf_groupをouter_join

In [11]:
pd.merge(df_name, df_group, how="outer")

   key    name     group
0    1   asuka      nogi
1    1   yuuki      nogi
2    2    rina    sakura
3    3    siho    hinata
4    4     NaN  yosimoto
5    5  manaka       NaN